package homeworks.home1;

public class Task11 {
    public static void main(String[] args) {
        //6. Составьте программу, выводящую на экран квадраты чисел от 10 до 20 включительно.
        for (int i = 10; i <= 20; i++) {
            System.out.println(i*i);
        }
    }
}
