package homeworks.home1;

public class Task14 {
    public static void main(String[] args) {
        //3. Напишите программу, которая выводит на консоль таблицу умножения.
        for(int i=1;i<=10;i++){
            for(int j=1;j<=10;j++){
                int sum=i*j;
                System.out.println(sum);
            }
        }
    }
}
